def triangles():
    l1=[1]
    l2=[1,1]
    yield(l1)
    while len(l1)<=10: 
        i=0 
        a=0 
        l2=[] 
        while i<(len(l1)-1):#必须小于（长度-1），要不会溢出
            a=l1[i]+l1[i+1]
            l2.append(a)#得到除首尾元素以外的元素
            i=i+1
        l1=[1,1] #重置L1，首尾都是1
        for d in l2: #将L2插入L1
            l1.insert(-1,d) #倒着插入
        yield l1

# 期待输出:
# [1]
# [1, 1]
# [1, 2, 1]
# [1, 3, 3, 1]
# [1, 4, 6, 4, 1]
# [1, 5, 10, 10, 5, 1]
# [1, 6, 15, 20, 15, 6, 1]
# [1, 7, 21, 35, 35, 21, 7, 1]
# [1, 8, 28, 56, 70, 56, 28, 8, 1]
# [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
n = 0
results = []
for t in triangles():
    print(t)
    results.append(t)
    n = n + 1
    if n == 10:
        break
if results == [
    [1],
    [1, 1],
    [1, 2, 1],
    [1, 3, 3, 1],
    [1, 4, 6, 4, 1],
    [1, 5, 10, 10, 5, 1],
    [1, 6, 15, 20, 15, 6, 1],
    [1, 7, 21, 35, 35, 21, 7, 1],
    [1, 8, 28, 56, 70, 56, 28, 8, 1],
    [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
]:
    print('测试通过!')
else:
    print('测试失败!')